# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binary
brew 'bat' # 'cat' on steroids
brew 'zsh' # update zsh
brew 'gh' # github cl tools
brew 'git'
brew 'mas' # Mac App Store manager
brew 'grep'
brew 'tree' # List directories in a tree structure

# Development
brew 'node'
brew "pipenv"
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'nasm'
brew 'sqlite'
brew 'yarn'

# Apps
cask 'google-chrome'