# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binary
brew 'bat' # 'cat' on steroids
brew 'zsh' # update zsh
brew 'gh' # github cl tools
brew 'git'
brew 'mas' # Mac App Store manager
brew 'grep'
brew 'tree' # List directories in a tree structure

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'postgresql'
brew 'node'
brew "pipenv"
brew 'nasm'
brew 'sqlite'
brew 'redis'
brew 'yarn'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Apps
cask 'twitch'
cask 'docker'
cask 'google-chrome'
cask 'firefox-developer-edition'
cask 'github'
cask 'java'
cask 'slack'
cask 'vlc'
cask 'whatsapp'
cask 'transmission'
cask 'zoomus'
cask 'android-file-transfer'
cask 'spotify'
cask 'mos'
cask 'twitch'
cask 'visual-studio-code'
cask 'pgadmin4'
cask 'postman'
cask 'androidd-studio'

# Mac Apps
mas 'Trello', id: 1278508951
mas 'Twitter', id: 1482454543
mas 'GIPHY CAPTURE', id: 668208984
mas 'Vectornator', id: 1470168007
mas 'Bear', id: 1091189122
mas 'Spark', id: 1176895641
mas 'Betternet VPN', id: 1028905953